app/views/items/index.html.erb

        <h3>
          <small><% item.genres.each do |genre| %>
---
SELECT  "genres".* FROM "genres" WHERE "genres"."item_id" = ? LIMIT 1  [["item_id", 4]]