app/views/items/show.html.erb

SELECT "genres".* FROM "genres" WHERE "genres"."item_id" = ?  [["item_id", 6]]
---
	<h1>
		<%= @item.name %> 	<small><% @item.genres.each do |genre| %>

SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 4]]
---
<div class='comments'>
	<p><%= @item.comments.count %> Comments</p>