app/controllers/comments_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("nickname", "body", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nickname", "hello"], ["body", "i like it"], ["item_id", 4], ["created_at", "2016-03-01 06:04:29.386365"], ["updated_at", "2016-03-01 06:04:29.386365"]]
---
  def create
    @item= Item.find(params[:item_id])
    @comment = @item.comments.new(comment_params)

    respond_to do |format|
      if @comment.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."item_id" = ? AND "comments"."id" = ? LIMIT 1  [["item_id", 4], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @item= Item.find(params[:item_id])
    @comment=@item.comments.find(params[:id])
    @comment.destroy