app/controllers/items_controller.rb

SELECT "items".* FROM "items"  ORDER BY created_at DESC
---
  def index
    @items = Item.all.order('created_at DESC')

INSERT INTO "items" ("name", "description", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hello "], ["description", "music video from Adel"], ["url", "www.youtube.com"], ["created_at", "2016-03-01 04:30:55.352077"], ["updated_at", "2016-03-01 04:30:55.352077"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "很好看，美剧，但是也没什么内容情节。"], ["updated_at", "2016-03-01 08:12:12.636585"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)